app/controllers/events_controller.rb

INSERT INTO "events" ("description", "name", "address1", "address2", "city", "state", "zip", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save